cask_args appdir: "/Applications"

# brew tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "progrhyme/tap"
tap "sidneys/homebrew"

brew "autoconf"
brew "automake"
brew "ain"
brew "bat"
brew "byobu"
brew "bitwarden-cli"
brew "caddy"
brew "cask"
brew "chezmoi"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gnutls"
brew "lsd"
brew "mas"
brew "macup"
brew "mise"
brew "mkcert"
brew "mpd"
brew "ncmpcpp"
brew "moreutils"
brew "multitail"
brew "nmap"
brew "ripgrep"
brew "sheldon"
brew "starship"

cask "brave-browser"
cask "betterdisplay"
cask "cloudflare-warp"
cask "cursor"
cask "cheatsheet"
cask "clipy"
cask "deepl"
cask "discord"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "github"
cask "notion"
cask "obsidian"
cask "onyx"
cask "raycast"
cask "rectangle"
cask "tabby"
cask "wireshark"
