cask_args appdir: "/Applications"

# brew tap
tap "homebrew/bundle"

brew "bat"
brew "byobu"
brew "bitwarden-cli"
brew "cask"
brew "chezmoi"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "lsd"
brew "mise"
brew "mkcert"
brew "mpd"
brew "ncmpcpp"
brew "moreutils"
brew "multitail"
brew "nmap"
brew "ripgrep"
brew "sheldon"
brew "starship"

cask "brave-browser"
cask "cloudflare-warp"
cask "cursor"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "obsidian"
cask "onyx"
cask "raycast"
cask "rectangle"
cask "tabby"
cask "wireshark"
