cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "aquaproj/aqua"

brew "age"
brew "act"
brew "autoconf"
brew "automake"
brew "ain"
brew "bat"
brew "byobu"
brew "bitwarden-cli"
brew "caddy"
brew "cask"
brew "chezmoi"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "jq"
brew "lsd"
brew "mas"
brew "mackup"
brew "mise"
brew "mkcert"
brew "mpd"
brew "ncmpcpp"
brew "moreutils"
brew "multitail"
brew "nmap"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tree"
brew "aquaproj/aqua/aqua"

cask "appcleaner"
cask "betterdisplay"
cask "bitwarden"
cask "blender"
cask "brave-browser"
cask "canva"
cask "cheatsheet"
cask "clipy"
cask "cloudflare-warp"
cask "cursor"
cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "drawio"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "github"
cask "google-cloud-sdk"
cask "insomnia"
cask "karabiner-elements"
cask "mp3tag"
cask "notion"
cask "obsidian"
cask "onyx"
cask "raycast"
cask "rectangle"
cask "tabby"
cask "wireshark"
