cask_args appdir: "/Applications"

# brew tap

tap "yusukebe/tap"

# tap "d12frosted/emacs-plus"
# tap "progrhyme/tap"
# tap "sidneys/homebrew"
# tap "go-gitea/gitea"
#tap "beeftornado/rmtree"
#tap "c-bata/kube-prompt"
#tap "yammerjp/tap"
#tap "hashicorp/tap"

# formula

# brew "age"
# brew "act"
brew "autoconf"
brew "automake"
brew "ain"
# brew "aqua"
# brew "awscli"
#brew "aespipe"
#brew "ansible"
#brew "apache2"
#brew "aria2"
#brew "asdf"
brew "bat"
brew "bash"
brew "bash-completion"
brew "byobu"
# brew "bison"
# brew "biome"
#brew "bitwarden-cli"
#brew "blueutil"
#brew "boost
brew "ca-certificates"
# brew "caddy"
brew "cask"
# brew "chezmoi"
#brew "cabextract"
# brew "cloudflared"
#brew "evernote2md"
# brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "fortune"
brew "figlet"
# brew "gh"
brew "glib"
#brew "guile"
brew "gnutls"
#brew "gnu-sed"
# brew "graphviz"
#brew "cdrtools"
#brew "citus"
#brew "clisp"
# brew "cmake"
brew "cmatrix"
brew "cowsay"
#brew "ctop"
# brew "colima"
#brew "deno"
# brew "docker"
# brew "docker-buildx"
# brew "docker-compose"
# brew "docker-machine"
#brew "fisher"
brew "gcc"
#brew "ghq"
brew "git"
#brew "gnu-tar"
brew "gnupg"
brew "grpc"
# brew "hadolint"
#brew "hashcash"
#brew "hashcat"
#brew "hub"
#brew "helm"
#brew "hyperkit"
# brew "jq"
#brew "jsoncpp"
brew "keploy"
brew "lsd"
brew "lolcat"
#brew "libslirp"
#brew "libtool"
#brew "libssh"
brew "mas"
brew "make"
brew "mackup"
brew "mise"
# brew "mkcert"
brew "mpd"
brew "mpc"
brew "ncmpcpp"
brew "moreutils"
brew "multitail"
brew "nmap"
#brew "ossp-uuid"
brew "tcl-tk"
brew "reattach-to-user-namespace"
brew "ripgrep"
# brew "re2c"
brew "php"
# brew "pkg-config"
# brew "podman"
#brew "python-tk@3"
#brew "plantuml"
#brew "postgrest"
#brew "postgresql@16"
#brew "p11-kit"
brew "qemu"
brew "rj"
brew "shellcheck"
brew "sheldon"
brew "starship"
brew "speedtest-cli"
# brew "socat"
#brew "soci"
#brew "snappy"
#brew "sshrc"
#brew "sqlite"
brew "tlrc"
brew "tree"
brew "translate-shell"
#brew "tig"
#brew "tcptraceroute"
#brew "unbound"
# brew "uaseg"
brew "vim"
#brew "watchman"
# brew "wget"
brew "whois"
#brew "wimlib"
#brew "w3m"
brew "xdg-ninja"
#brew "xz"
brew "yt-dlp"
#brew "z"
brew "zlib"
#brew "zsh"
#brew "zsh-completions"
#brew "zsh-fast-syntax-highlighting"
#brew "zsh-async"
#brew "zsh-autocomplete"
#brew "zsh-autosuggestions"
#brew "zsh-navigation-tools"
#brew "zstd"

#brew "progrhyme/tap/shelp"
#brew "yammerjp/tap/pdef"
#brew "sidneys/homebrew/openssl@1.0"
#brew "sidneys/homebrew/chntpw"
#brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-spacemacs-icon"], args: ["with-native-comp"], link: false

#cask

#cask "1password"
cask "appcleaner"
cask "alacritty"
#cask "android-studio"
# cask "authy"
#cask "abstract"
#cask "anki"
#cask "anaconda"
# cask "arc"
cask "betterdisplay"
cask "bitwarden"
# cask "blender"
cask "brave-browser"
cask "balenaetcher"
#cask "bdash
#cask "binance"
cask "clipy"
cask "cloudflare-warp"
cask "cursor"
# cask "caffeine"
#cask "cakebrew"
#cask "calibre"
cask "canva"
cask "claude"
#cask "cleanmymac"
#cask "codux"
#cask "coda"
# cask "contexts"
# cask "cursr"
#cask "cyberduck"
#cask "chrome-remote-desktop-host"
# cask "dbeaver-community"
# cask "deepl"
cask "discord"
# cask "drawio"
#cask "dash"
#cask "dotnet-sdk"
# cask "docker"
#cask "emacs"
# cask "element"
#cask "epic-games"
#cask "evernote"
#cask "cdm-eiakna"
#cask "fantastical"
#cask "fl-stufio"
#cask "fig"
# cask "figma"
# cask "finch"
cask "font-hackgen-nerd"
cask "font-roboto-mono-nerd-font"
cask "font-reggae-one"
cask "font-sauce-code-pro-nerd-font"
cask "github"
# cask "gimp"
cask "google-cloud-sdk"
cask "google-chrome"
#cask "grandperspective"
# cask "geekbench"
# cask "hakuneko"
# cask "insomnia"
# cask "inkscape"
#cask "intellij-idea"
#cask "iterm2"
#cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyclu"
#cask "keka"
#cask "kitty"
#cask "krita"
cask "ledger-live"
# cask "lens"
#cask "lulu"
#cask "logseq"
#cask "macfuse"
#cask "marta"
#cask "megasync"
# cask "meld"
#cask "microsoft-teams"
#cask "mongodb-compass"
# cask "mp3tag"
cask "mp3gain-express"
cask "mac-mouse-fix"
cask "multipass"
cask "musicbrainz-picard"
#cask "mamp"
# cask "monitorcontrol"
cask "notion"
#cask "ngrok"
#cask "nuclear"
#cask "nvidia-geforce-now"
cask "obsidian"
cask "onyx"
cask "orbstack"
# cask "paw"
#cask "paw"
#cask "pencil"
#cask "pokerstars"
# cask "podman-desktop"
# cask "postman"
#cask "postman-agent"
#cask "pgadmin4"
# cask "parallel-client"
#cask "qbittorrent"
#cask "qt-creator"
cask "raycast"
cask "rectangle"
cask "raspberry-pi-imager"
# cask "rancher"
#cask "raindropio"
# cask "readdle-spark"
#cask "remix-ide"
#cask "responsively"
#cask "rustdesk"
#cask "roam-research"
#cask "slack"
# cask "steam"
#cask "sketch"
#cask "skitch"
#cask "skype"
#cask "sublime-text"
#cask "swift-quit"
#cask "sonic-pi"
#cask "spotify"
#cask "stats"
#cask "studio-3t"
#cask "flameshot"
#cask "flutter"
cask "tabby"
#cask "tagspaces"
#cask "tableplus"
cask "the-unarchiver"
#cask "tor-browser"
# cask "temurin"
cask "tradingview"
#cask "unity"
#cask "unity-hub"
# cask "utm"
#cask "veracrypt"
#cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
#cask "vnc-viewer"
# cask "wireshark"
cask "windows-app"
#cask "warp"
#cask "webcatalog"
# cask "wezterm"
#cask "wordpresscom"
# cask "wpsoffice"
# cask "wine-stable"
# cask "xampp"
#cask "xbar"
# cask "xmind"
cask "xquartz"
#cask "wkhtmltopdf"
# cask "zoom"

# mas

#mas "xcode", id: 497799835
# mas "GarageBand", id: 682658836
#mas "Final Cut Pro", id: 424389933
#mas "Motion", id: 434290957
#mas "Compressor", id: 424390742
#mas "MainStage", id: 634159523
# mas "iMovie", id: 408981434
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Keynote", id: 409183694
#mas "Apple Developer", id: 640199958
#mas "Alfred", id: 405843582
#mas "GoPro Quik", id: 561350520
#mas "Shapr3D の CAD モデリング", id: 1091675654
#mas "PhotoScape X - 画像加工, 写真編集", id: 2145173578
# mas "Capo 3", id: 696977615
# mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
# mas "Microsoft PowerPoint", id: 462062816
# mas "ServerCat", id: 1501532023
# mas "System Designer", id: 1102494854
mas "LogicPro", id: 634148309
mas "LINE", id: 539883307
mas "Speedtest", id: 1153157709
mas "Shazam", id: 897118787
mas "Popclip", id: 445189367
mas "RunCat", id: 1429033973
mas "Plash", id: 1494023538
mas "Spark", id: 1176895641
mas "Hidden Bar", id: 1452453066
# mas "Hyper Cursor", id: 1634220679
# mas "Day One", id: 1055511498
# mas "Telegram", id: 747648890
# mas "そらの案内", id: 599799247
# mas "Remote Ripple", id: 1253403918
# mas "Jayson", id: 1468691718
# mas "BetterSnapTools", id: 417375580
#mas "TabLauncher", id: 421340897
# mas "Linearity Curve ベクターグラフィックデザイン", id: 1219074514
# mas "djay - DJ アプリ& ミキサー", id: 450527929
#mas "Exporter", id: 1099120373
# mas "xAppBuilder", id: 6447613145
